## How to change data type of columns
stack link: https://stackoverflow.com/questions/15891038/change-data-type-of-columns-in-pandas

In [ ]:
import pandas as pd
import numpy as np

In [4]:
raw_data = {'name': ['Amy', 'Bob', 'Carol'], 
        'age': [23,35,46], 
        'score': [66.7,83.4,76.5],
           'whatever':['221', 223, '']}
df = pd.DataFrame(raw_data)
df

    name  age  score whatever
0    Amy   23   66.7      221
1    Bob   35   83.4      223
2  Carol   46   76.5

## 1. astype()

In [11]:
df['whatever'].astype(str)

0    221
1    223
2
Name: whatever, dtype: object

In [14]:
df.astype({'age':float})

    name   age  score whatever
0    Amy  23.0   66.7      221
1    Bob  35.0   83.4      223
2  Carol  46.0   76.5

## 2. infer_objects()

In [17]:
# converting columns of a DataFrame that have an object datatype to a more specific type
df.infer_objects()

    name  age  score whatever
0    Amy   23   66.7      221
1    Bob   35   83.4      223
2  Carol   46   76.5

In [16]:
df.infer_objects().dtypes

name         object
age           int64
score       float64
whatever     object
dtype: object